In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('./world_cities.csv')
df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           249 non-null    int64
 1   City / Urban area    249 non-null    object
 2   Country              249 non-null    object
 3   Population           249 non-null    int64
 4   Land area (in sqKm)  249 non-null    int64
dtypes: int64(3), object(2)
memory usage: 9.9+ KB

In [5]:
df['City / Urban area'].unique()

array(['Buenos Aires', 'Melbourne', 'Sydney', 'Brisbane', 'Perth',
       'Adelaide', 'Gold Coast', 'Vienna', 'Baku/Sumqayit', 'Brussels',
       'Antwerp', 'Sao Paulo', 'Rio de Janeiro', 'Belo Horizonte',
       'Curitiba', 'Brasilia', 'Fortaleza', 'Porto Alegre', 'Campinas',
       'Goiania', 'Recife', 'Phnom Penh', 'Montreal.', 'Toronto',
       'Vancouver', 'Edmonton', 'Calgary', 'Quebec', 'Ottawa/Hull',
       'Winnipeg', 'St. Catharines', 'Santiago', 'Beijing', 'Shanghai',
       'Shenzhen', 'Shenyang', 'Tianjin', 'Dalian', 'Bogota', 'Kinshasa',
       'Lumumbashi', 'Copenhagen', 'Quito', 'Cairo', 'Helsinki', 'Paris',
       'Marseille', 'Bordeaux', 'Lyon', 'Toulouse', 'Nice', 'Toulon',
       'Avignon', 'Valenciennes', 'Douai/Lens', 'Nantes', 'Lille', 'Pau',
       'Tours', 'Bethune', 'Essen/Düsseldorf', 'Berlin', 'Frankfurt',
       'Hamburg', 'Cologne/Bonn', 'Munich', 'Stuttgart', 'Aachen',
       'Accra', 'Athens', 'Budapest', 'Delhi', 'Hyderabad', 'Bangalore',
       'Kolkata', 'Mumbai', 'Chennai', 'Jakarta', 'Tehran', 'Baghdad',
       'Dublin', 'Tel Aviv', 'Milan', 'Rome', 'Naples', 'Turin',
       'Tokyo/Yokohama', 'Nagoya', 'Osaka/Kobe/Kyoto', 'Fukuoka',
       'Sapporo', 'Kuwait', 'Beirut', 'Kuala Lumpur', 'Mexico City',
       'Guadalajara', 'Monterey', 'Rotterdam', 'Auckland', 'Lagos',
       'Lahore', 'Karachi', 'Lima', 'Manila', 'Katowice', 'Warsaw',
       'Lisbon', 'Porto', 'San Juan', 'Aguadilla', 'Moscow',
       'St Petersburg', 'Nizhni Novgorod', 'Arabia', 'Riyadh', 'Jeddah',
       'Singapore', 'Johannesburg/East Rand', 'Durban', 'Cape Town',
       'Pretoria', 'Vereeniging', 'Port Elizabeth', 'Seoul/Incheon',
       'Madrid', 'Barcelona', 'Khartoum', 'Stockholm', 'Taichung',
       'Taipei', 'Bangkok', 'Istanbul', 'Ankara', 'Abu Dhabi', 'Dubai',
       'London', 'Birmingham', 'Manchester', 'Leeds/Bradford', 'Glasgow',
       'Donetsk', 'New York Metro', 'Chicago', 'Atlanta', 'Philadelphia',
       'Boston', 'Los Angeles', 'Dallas/Fort Worth', 'Houston', 'Detroit',
       'Washington', 'Miami', 'Seattle', 'Minneapolis/St. Paul',
       'Pittsburgh', 'St. Louis', 'Tampa//St. Petersburg', 'Phoenix/Mesa',
       'San Diego', 'Baltimore', 'Cincinnati', 'Cleveland', 'Kansas City',
       'Indianapolis', 'San Francisco//Oakland', 'Virginia Beach',
       'Providence', 'Denver', 'Milwaukee', 'Portland', 'Hartford',
       'Bridgeport//Stamford', 'Orlando', 'Riverside/San Bernardino',
       'Richmond', 'Charlotte', 'Nashville', 'Jacksonville',
       'San Antonio', 'Memphis', 'Columbus', 'Louisville', 'Sacramento',
       'Buffalo', 'Knoxville', 'Dayton', 'Oklahoma City', 'Raleigh',
       'Austin', 'McAllen', 'Springfield', 'Akron', 'Rochester', 'Tucson',
       'Chattanooga', 'Allentown/Bethlehem', 'Barnstable Town',
       'Las Vegas', 'New Haven', 'Albany', 'Baton Rouge',
       'Sarasota//Bradenton', 'Columbia', 'Poughkeepsie', 'Tulsa',
       'San Jose', 'Grand Rapids', 'Winston/Salem', 'Worcester',
       'Augusta', 'Flint', 'Charleston', 'Salt Lake City', 'Youngstown',
       'Greenville', 'Omaha', 'Albuquerque', 'Palm Bay', 'El Paso',
       'Pensacola', 'Hickory', 'Mobile', 'Harrisburg', 'Asheville',
       'Little Rock', 'Toledo', 'Lancaster', 'New Orleans',
       'Colorado Springs', 'Cape Coral', 'Ogden', 'Syracuse', 'Wichita',
       'Concord', 'Port St Lucie', 'Fayetteville', 'Jackson', 'Scranton',
       'Huntsville', 'Durham', 'South Bend', 'Shreveport', 'Honolulu',
       'Bonita Springs / Naples', 'Canton', 'Spokane', 'Tashkent',
       'Ho Chi Minh City', 'Harare'], dtype=object)

In [6]:
df['City / Urban area'].value_counts()

Lagos                   1
Munich                  1
Naples                  1
Orlando                 1
Denver                  1
                       ..
Lima                    1
Salt Lake City          1
Budapest                1
Bridgeport//Stamford    1
Vienna                  1
Name: City / Urban area, Length: 249, dtype: int64

In [7]:
df['City / Urban area'].describe()

count       249
unique      249
top       Lagos
freq          1
Name: City / Urban area, dtype: object

In [8]:
df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [17]:
df[(df['Population'] / df['Land area (in sqKm)']) > 10000].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 32 to 129
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           19 non-null     int64
 1   City / Urban area    19 non-null     object
 2   Country              19 non-null     object
 3   Population           19 non-null     int64
 4   Land area (in sqKm)  19 non-null     int64
dtypes: int64(3), object(2)
memory usage: 912.0+ bytes

In [26]:
df['Country'].value_counts()[df['Country'].value_counts() == 4]

Italy    4
Name: Country, dtype: int64

In [2]:
%matplotlib inline

import pandas as pd

In [3]:
df

NameError: name 'df' is not defined

In [5]:
df.head()

   Unnamed: 0 City / Urban area    Country  Population  Land area (in sqKm)
0           0      Buenos Aires  Argentina    11200000                 2266
1           1         Melbourne  Australia     3162000                 2080
2           2            Sydney  Australia     3502000                 1687
3           3          Brisbane  Australia     1508000                 1603
4           4             Perth  Australia     1177000                  964

In [6]:
df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [7]:
df.shape

(249, 5)

In [9]:
df.columns

Index(['Unnamed: 0', 'City / Urban area', 'Country', 'Population',
       'Land area (in sqKm)'],
      dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           249 non-null    int64
 1   City / Urban area    249 non-null    object
 2   Country              249 non-null    object
 3   Population           249 non-null    int64
 4   Land area (in sqKm)  249 non-null    int64
dtypes: int64(3), object(2)
memory usage: 9.9+ KB

In [11]:
df.describe()

       Unnamed: 0    Population  Land area (in sqKm)
count  249.000000  2.490000e+02           249.000000
mean   124.273092  3.006538e+06          1035.212851
std     72.369388  4.136435e+06          1033.487331
min      0.000000  1.810000e+05           365.000000
25%     62.000000  5.980000e+05           511.000000
50%    124.000000  1.500000e+06           684.000000
75%    187.000000  3.502000e+06          1116.000000
max    249.000000  3.320000e+07          8683.000000

In [13]:
df.sort_values(by='Population')

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm)
57,57,Pau,France,181000,450
220,221,Hickory,USA,188000,546
238,239,Huntsville,USA,213000,407
243,244,Bonita Springs / Naples,USA,221000,389
223,224,Asheville,USA,222000,536
...,...,...,...,...,...
94,94,Mexico City,Mexico,17400000,2072
123,123,Seoul/Incheon,South Korea,17500000,1049
11,11,Sao Paulo,Brazil,17700000,1968
141,141,New York Metro,USA,17800000,8683
86,86,Tokyo/Yokohama,Japan,33200000,6993

In [18]:
df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [16]:
type(df['Population'])

pandas.core.series.Series

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           249 non-null    int64
 1   City / Urban area    249 non-null    object
 2   Country              249 non-null    object
 3   Population           249 non-null    int64
 4   Land area (in sqKm)  249 non-null    int64
dtypes: int64(3), object(2)
memory usage: 9.9+ KB

In [22]:
df.columns

Index(['Unnamed: 0', 'City / Urban area', 'Country', 'Population',
       'Land area (in sqKm)'],
      dtype='object')

In [23]:
df['Population'].unique()

array([11200000,  3162000,  3502000,  1508000,  1177000,  1002000,
         422000,  1550000,  2100000,  1570000,   915000, 17700000,
       10800000,  4000000,  2500000,  1625000,  2650000,  2800000,
        1750000,  1475000,  3025000,  1500000,  3216000,  4367000,
        1830000,   782000,   879000,   635000,   828000,   627000,
         300000,  5425000,  8614000, 10000000,  8000000,  4200000,
        4750000,  2750000,  7000000,  5000000,  1200000,  1525000,
       12200000,  1000000,  9645000,  1350000,   754000,  1349000,
         761000,   889000,   520000,   254000,   357000,   519000,
         545000,  1050000,   181000,   298000,   259000,  7350000,
        3675000,  2260000,  1925000,  1960000,  1600000,  1250000,
         585000,  3685000,  1800000, 14300000,  5300000,  5400000,
       12700000, 14350000,  5950000, 14250000,  7250000,  5500000,
        1075000,  2300000,  4250000,  2400000, 33200000,  9000000,
       16425000,  2150000,  2075000,  4400000, 17400000,  3500000,
        3200000,  1325000, 13400000,  5100000,  9800000, 14750000,
        2200000,  2000000,  2250000,  1035000,  2217000,   299000,
       10500000,  6000000,  2900000,  2700000,  1850000,   600000,
         900000, 17500000,  4900000,  3900000,  1400000,  5700000,
        6500000,  3100000,   550000,  1900000,  8278000,  2284000,
        2245000,  1499000, 17800000,  8308000,  5149000,  4032000,
       11789000,  4146000,  3823000,  3903000,  3934000,  4919000,
        2712000,  2389000,  1753000,  2078000,  2062000,  2907000,
        2674000,  2076000,  1503000,  1787000,  1362000,  1219000,
        3229000,  1394000,  1175000,  1985000,  1309000,  1583000,
         852000,  1157000,  1507000,   819000,   759000,   750000,
         882000,  1328000,   972000,  1133000,   864000,  1393000,
         977000,   420000,   703000,   747000,   542000,   902000,
         523000,   574000,   570000,   694000,   720000,   344000,
         576000,   244000,  1314000,   531000,   559000,   479000,
         421000,   352000,   558000,  1538000,   539000,   430000,
         336000,   365000,   423000,   888000,   417000,   302000,
         598000,   393000,   675000,   324000,   188000,   318000,
         363000,   222000,   360000,   503000,  1009000,   466000,
         330000,   418000,   402000,   553000,   271000,   276000,
         293000,   385000,   213000,   288000,   275000,   718000,
         221000,   267000,   335000], dtype=int64)